<a href="https://colab.research.google.com/github/apurvadey/DataScience/blob/master/DataSchoolPandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## HOW TO READ A TABULAR DATA FILE INTO PANDAS

In [0]:
import pandas as pd
order = pd.read_table('http://bit.ly/chiporders')
order.head()

   order_id  ...  item_price
0         1  ...      $2.39
1         1  ...      $3.39
2         1  ...      $3.39
3         1  ...      $2.39
4         2  ...     $16.98

[5 rows x 5 columns]

In [0]:
ufo = pd.read_csv('http://bit.ly/uforeports')
type(ufo)
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

## HOW TO SELECT A PANDAS SERIES FROM A DATAFRAME

In [0]:
ufo['City']

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

In [0]:
type(ufo['City'])

pandas.core.series.Series

In [0]:
ufo.City

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

In [0]:
ufo['Colors Reported'] #If space present in Variable then we need to use this format

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
        ...
18236    NaN
18237    NaN
18238    NaN
18239    RED
18240    NaN
Name: Colors Reported, Length: 18241, dtype: object

### dot notation fails when any built-in word is used in column name

In [0]:
'ab' + 'cd'

'abcd'

In [0]:
ufo.City + ', ' + ufo.State

0                      Ithaca, NY
1                 Willingboro, NJ
2                     Holyoke, CO
3                     Abilene, KS
4        New York Worlds Fair, NY
                   ...
18236              Grant Park, IL
18237             Spirit Lake, IA
18238             Eagle River, WI
18239             Eagle River, WI
18240                    Ybor, FL
Length: 18241, dtype: object

### To add a new column, dot notation  is not going to work

In [0]:
#ufo.Location = ufo.City + ', ' + ufo.State #wrong way
ufo['Location'] = ufo.City + ', ' + ufo.State #right way

In [0]:
ufo.head()

                   City  ...                  Location
0                Ithaca  ...                Ithaca, NY
1           Willingboro  ...           Willingboro, NJ
2               Holyoke  ...               Holyoke, CO
3               Abilene  ...               Abilene, KS
4  New York Worlds Fair  ...  New York Worlds Fair, NY

[5 rows x 6 columns]

## WHY DO SOME PANDAS COMMANDS END WITH PARENTHESIS AND OTHERS DO NOT

In [0]:
movies = pd.read_csv('http://bit.ly/imdbratings')

In [0]:
movies.head()

   star_rating  ...                                        actors_list
0          9.3  ...  [u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...
1          9.2  ...    [u'Marlon Brando', u'Al Pacino', u'James Caan']
2          9.1  ...  [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
3          9.0  ...  [u'Christian Bale', u'Heath Ledger', u'Aaron E...
4          8.9  ...  [u'John Travolta', u'Uma Thurman', u'Samuel L....

[5 rows x 6 columns]

In [0]:
movies.describe()

       star_rating    duration
count   979.000000  979.000000
mean      7.889785  120.979571
std       0.336069   26.218010
min       7.400000   64.000000
25%       7.600000  102.000000
50%       7.800000  117.000000
75%       8.100000  134.000000
max       9.300000  242.000000

In [0]:
movies.shape

(979, 6)

In [0]:
movies.dtypes

star_rating       float64
title              object
content_rating     object
genre              object
duration            int64
actors_list        object
dtype: object

In [0]:
type(movies)

pandas.core.frame.DataFrame

## HOW TO RENAME COLUMNS IN A PANDAS DataFrame

In [0]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [0]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [0]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [0]:
ufo.rename(columns = {'Colors Reported': 'Colors_Reported'}, inplace = True)

In [0]:
ufo.head()

                   City Colors_Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [0]:
ufo_cols = ['city', 'colors reported', 'shape reported', 'state', 'time']
ufo.columns = ufo_cols
ufo.head()

                   city colors reported shape reported state             time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [0]:
ufo = pd.read_csv('http://bit.ly/uforeports', names=ufo_cols, header=0)
# header=0 means the existing column names would be overwritten by names
ufo.head()

                   city colors reported shape reported state             time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [0]:
ufo.columns = ufo.columns.str.replace(' ', '_')
ufo.columns

Index(['city', 'colors_reported', 'shape_reported', 'state', 'time'], dtype='object')

## HOW TO REMOVE COLUMNS FROM  A PANDAS DATAFRAME

In [4]:
import pandas as pd
ufo = pd.read_csv('http://bit.ly/uforeports')
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [5]:
ufo.shape

(18241, 5)

In [0]:
ufo.drop('Colors Reported', axis=1, inplace=True)

In [10]:
ufo.head()

                   City Shape Reported State             Time
0                Ithaca       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro          OTHER    NJ  6/30/1930 20:00
2               Holyoke           OVAL    CO  2/15/1931 14:00
3               Abilene           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair          LIGHT    NY  4/18/1933 19:00

In [0]:
ufo.drop(['City', 'State'], axis=1, inplace=True)

In [12]:
ufo.head()

  Shape Reported             Time
0       TRIANGLE   6/1/1930 22:00
1          OTHER  6/30/1930 20:00
2           OVAL  2/15/1931 14:00
3           DISK   6/1/1931 13:00
4          LIGHT  4/18/1933 19:00

In [13]:
ufo.shape

(18241, 2)

## HOW TO SORT A PANDAS DATAFRAME OR SERIES

### A dataframe is like a table, collection of rows and columns

### A Series is a single column

In [0]:
movies = pd.read_csv('http://bit.ly/imdbratings')

In [16]:
movies.head()

   star_rating  ...                                        actors_list
0          9.3  ...  [u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...
1          9.2  ...    [u'Marlon Brando', u'Al Pacino', u'James Caan']
2          9.1  ...  [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
3          9.0  ...  [u'Christian Bale', u'Heath Ledger', u'Aaron E...
4          8.9  ...  [u'John Travolta', u'Uma Thurman', u'Samuel L....

[5 rows x 6 columns]

In [18]:
movies.title.sort_values() #ascending order by default

542     (500) Days of Summer
5               12 Angry Men
201         12 Years a Slave
698                127 Hours
110    2001: A Space Odyssey
               ...
955         Zero Dark Thirty
677                   Zodiac
615               Zombieland
526                     Zulu
864                    [Rec]
Name: title, Length: 979, dtype: object

In [19]:
movies.sort_values('duration', ascending=False)

     star_rating  ...                                        actors_list
476          7.8  ...  [u'Kenneth Branagh', u'Julie Christie', u'Dere...
157          8.2  ...  [u'Clark Gable', u'Vivien Leigh', u'Thomas Mit...
78           8.4  ...  [u'Robert De Niro', u'James Woods', u'Elizabet...
142          8.3  ...  [u'Aamir Khan', u'Gracy Singh', u'Rachel Shell...
445          7.9  ...  [u'Charlton Heston', u'Yul Brynner', u'Anne Ba...
..           ...  ...                                                ...
293          8.1  ...    [u'Groucho Marx', u'Harpo Marx', u'Chico Marx']
88           8.4  ...  [u'Charles Chaplin', u'Edna Purviance', u'Jack...
258          8.1  ...  [u'Werner Krauss', u'Conrad Veidt', u'Friedric...
338          8.0  ...  [u'Aleksandr Antonov', u'Vladimir Barsky', u'G...
389          8.0  ...  [u'Wallace Ford', u'Leila Hyams', u'Olga Bacla...

[979 rows x 6 columns]

In [20]:
movies.head()

   star_rating  ...                                        actors_list
0          9.3  ...  [u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...
1          9.2  ...    [u'Marlon Brando', u'Al Pacino', u'James Caan']
2          9.1  ...  [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
3          9.0  ...  [u'Christian Bale', u'Heath Ledger', u'Aaron E...
4          8.9  ...  [u'John Travolta', u'Uma Thurman', u'Samuel L....

[5 rows x 6 columns]

In [22]:
movies.sort_values(['content_rating', 'duration'])
#sorts according to first parameter first then the following

     star_rating  ...                                        actors_list
713          7.6  ...  [u'Phil Harris', u'Sebastian Cabot', u'Louis P...
513          7.8  ...  [u'Kevin McCarthy', u'Dana Wynter', u'Larry Ga...
272          8.1  ...  [u'Sterling Hayden', u'Coleen Gray', u'Vince E...
703          7.6  ...  [u'Bela Lugosi', u'Helen Chandler', u'David Ma...
612          7.7  ...  [u'John Lennon', u'Paul McCartney', u'George H...
..           ...  ...                                                ...
387          8.0  ...  [u'Dustin Hoffman', u'Jon Voight', u'Sylvia Mi...
86           8.4  ...  [u'Malcolm McDowell', u'Patrick Magee', u'Mich...
187          8.2  ...  [u'Paul Newman', u'Robert Redford', u'Katharin...
936          7.4  ...    [u'John Wayne', u'Kim Darby', u'Glen Campbell']
649          7.7  ...  [u'Richard Burton', u'Clint Eastwood', u'Mary ...

[979 rows x 6 columns]

## HOW TO FILTER ROWS OF A PANDAS DATAFRAME BY COLUMN VALUE

In [25]:
movies = pd.read_csv('https://bit.ly/imdbratings')
movies.head()

   star_rating  ...                                        actors_list
0          9.3  ...  [u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...
1          9.2  ...    [u'Marlon Brando', u'Al Pacino', u'James Caan']
2          9.1  ...  [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
3          9.0  ...  [u'Christian Bale', u'Heath Ledger', u'Aaron E...
4          8.9  ...  [u'John Travolta', u'Uma Thurman', u'Samuel L....

[5 rows x 6 columns]

In [24]:
movies.shape

(979, 6)

In [0]:
booleans = []
for length in movies.duration:
  if length >= 200:
    booleans.append(True)
  else:
    booleans.append(False)

In [27]:
booleans[0:5]

[False, False, True, False, False]

In [28]:
is_long = pd.Series(booleans) #converts boolean into a pandas series
is_long.head()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [29]:
movies[is_long] #only shows the movies abiding by the condition applied in few LOCs

     star_rating  ...                                        actors_list
2            9.1  ...  [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
7            8.9  ...  [u'Elijah Wood', u'Viggo Mortensen', u'Ian McK...
17           8.7  ...  [u'Toshir\xf4 Mifune', u'Takashi Shimura', u'K...
78           8.4  ...  [u'Robert De Niro', u'James Woods', u'Elizabet...
85           8.4  ...  [u"Peter O'Toole", u'Alec Guinness', u'Anthony...
142          8.3  ...  [u'Aamir Khan', u'Gracy Singh', u'Rachel Shell...
157          8.2  ...  [u'Clark Gable', u'Vivien Leigh', u'Thomas Mit...
204          8.1  ...  [u'Charlton Heston', u'Jack Hawkins', u'Stephe...
445          7.9  ...  [u'Charlton Heston', u'Yul Brynner', u'Anne Ba...
476          7.8  ...  [u'Kenneth Branagh', u'Julie Christie', u'Dere...
630          7.7  ...  [u'Denzel Washington', u'Angela Bassett', u'De...
767          7.6  ...  [u'Spencer Tracy', u'Milton Berle', u'Ethel Me...

[12 rows x 6 columns]

In [31]:
#ALTERNATIVE with 2 LOCs
is_long = movie.duration >=200
is_long.head()

0    False
1    False
2     True
3    False
4    False
Name: duration, dtype: bool

In [33]:
movies[movies.duration >=200] #ALTERNATIVE with 1 LOC

     star_rating  ...                                        actors_list
2            9.1  ...  [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
7            8.9  ...  [u'Elijah Wood', u'Viggo Mortensen', u'Ian McK...
17           8.7  ...  [u'Toshir\xf4 Mifune', u'Takashi Shimura', u'K...
78           8.4  ...  [u'Robert De Niro', u'James Woods', u'Elizabet...
85           8.4  ...  [u"Peter O'Toole", u'Alec Guinness', u'Anthony...
142          8.3  ...  [u'Aamir Khan', u'Gracy Singh', u'Rachel Shell...
157          8.2  ...  [u'Clark Gable', u'Vivien Leigh', u'Thomas Mit...
204          8.1  ...  [u'Charlton Heston', u'Jack Hawkins', u'Stephe...
445          7.9  ...  [u'Charlton Heston', u'Yul Brynner', u'Anne Ba...
476          7.8  ...  [u'Kenneth Branagh', u'Julie Christie', u'Dere...
630          7.7  ...  [u'Denzel Washington', u'Angela Bassett', u'De...
767          7.6  ...  [u'Spencer Tracy', u'Milton Berle', u'Ethel Me...

[12 rows x 6 columns]

In [34]:
movies[movies.duration >=200].genre #['genre']

2          Crime
7      Adventure
17         Drama
78         Crime
85     Adventure
142    Adventure
157        Drama
204    Adventure
445    Adventure
476        Drama
630    Biography
767       Action
Name: genre, dtype: object

In [37]:
movies.loc[movies.duration >= 200, 'genre'] #another powerful way of passing conditioned row and column as parameter

2          Crime
7      Adventure
17         Drama
78         Crime
85     Adventure
142    Adventure
157        Drama
204    Adventure
445    Adventure
476        Drama
630    Biography
767       Action
Name: genre, dtype: object

## HOW TO APPLY MULTIPLE FILTER CRITERIA TO A PANDAS DATAFRAME

In [38]:
movies.head()

   star_rating  ...                                        actors_list
0          9.3  ...  [u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...
1          9.2  ...    [u'Marlon Brando', u'Al Pacino', u'James Caan']
2          9.1  ...  [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
3          9.0  ...  [u'Christian Bale', u'Heath Ledger', u'Aaron E...
4          8.9  ...  [u'John Travolta', u'Uma Thurman', u'Samuel L....

[5 rows x 6 columns]

In [41]:
movies[(movies.duration >=200) & (movies.genre == 'Drama')] #multiple conditions with logical operators working on boolean resultant

     star_rating  ...                                        actors_list
17           8.7  ...  [u'Toshir\xf4 Mifune', u'Takashi Shimura', u'K...
157          8.2  ...  [u'Clark Gable', u'Vivien Leigh', u'Thomas Mit...
476          7.8  ...  [u'Kenneth Branagh', u'Julie Christie', u'Dere...

[3 rows x 6 columns]

In [44]:
movies[movies.genre.isin(['Crime', 'Drame', 'Action'])]
#movies[(movies.genre == 'Crime') | (movies.genre == 'Drame') | (movies.genre == 'Action')] is a LONG WAY

     star_rating  ...                                        actors_list
0            9.3  ...  [u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...
1            9.2  ...    [u'Marlon Brando', u'Al Pacino', u'James Caan']
2            9.1  ...  [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
3            9.0  ...  [u'Christian Bale', u'Heath Ledger', u'Aaron E...
4            8.9  ...  [u'John Travolta', u'Uma Thurman', u'Samuel L....
..           ...  ...                                                ...
963          7.4  ...  [u'Anne Parillaud', u'Marc Duret', u'Patrick F...
967          7.4  ...   [u'Sean Connery', u'Nicolas Cage', u'Ed Harris']
969          7.4  ...  [u'Gerard Butler', u'Jamie Foxx', u'Leslie Bibb']
976          7.4  ...  [u'Russell Crowe', u'Paul Bettany', u'Billy Bo...
978          7.4  ...  [u'Charlie Sheen', u'Michael Douglas', u'Tamar...

[260 rows x 6 columns]